
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ЦеныТарифовОпераций
	Движения.ЦеныТарифовОпераций.Записывать = Истина;
	Для Каждого ТекСтрокаТарифОбработкиДляХаба из ТарифОбработкиДляХаба Цикл
		Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.Хаб;
		Движение.Период = Дата;
		Движение.Цена = ТекСтрокаТарифОбработкиДляХаба.Цена;
		Движение.КоличествоОт = ТекСтрокаТарифОбработкиДляХаба.КоличествоОт;
		Движение.КоличествоДо = ТекСтрокаТарифОбработкиДляХаба.КоличествоДо;
	КонецЦикла;
    
    Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Хранение;
		Движение.Период = Дата;
		Движение.Цена = ЦенаДняХранения;
	
	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.МГТ;
		Движение.Период = Дата;
		Движение.Цена = ЦенаМГТ;

	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.КГТ;
		Движение.Период = Дата;
		Движение.Цена = ЦенаКГТ;
		
	Движение = Движения.ЦеныТарифовОпераций.Добавить();
		Движение.ВидОперации = Перечисления.ВидыОпераций.Обработка;
		Движение.ТипГрузовогоМеста = Перечисления.ТипыГрузовыхМест.Шины;
		Движение.Период = Дата;
		Движение.Цена = ЦенаШины;
	
КонецПроцедуры
#КонецОбласти